In [1]:
import pandas as pd
import numpy as np

In [4]:
stuff = {
    'Corporation':['Apple', 'Google', 'Meta', 'Apple', 'Google','Meta'],
    'Employees':['John', 'April', 'Wes', 'Beth', 'Justin', 'Steph'],
    'Salary':[200, 220, 190, 130, 120, 150]}
my_df = pd.DataFrame(stuff)
my_df

  Corporation Employees  Salary
0       Apple      John     200
1      Google     April     220
2        Meta       Wes     190
3       Apple      Beth     130
4      Google    Justin     120
5        Meta     Steph     150

In [12]:
company = my_df.groupby('Corporation')
company

In [22]:
# SUM (USE numeric_only=True WHEN USING MATH FORMULAS)
company.sum(numeric_only=True)

             Salary
Corporation
Apple           330
Google          340
Meta            340

In [23]:
# MEAN (srednee)
company.mean(numeric_only=True)

             Salary
Corporation
Apple         165.0
Google        170.0
Meta          170.0

In [25]:
company.max() # can use numeric_only=True if you want to

            Employees  Salary
Corporation
Apple            John     200
Google         Justin     220
Meta              Wes     190

In [27]:
# Standard deviation
company.std(numeric_only=True)

                Salary
Corporation
Apple        49.497475
Google       70.710678
Meta         28.284271

In [30]:
# Variance 
company.var(numeric_only=True)

             Salary
Corporation
Apple        2450.0
Google       5000.0
Meta          800.0

In [32]:
# Count
company.count() # can use numeric_only=True if you want to

             Employees  Salary
Corporation
Apple                2       2
Google               2       2
Meta                 2       2

In [34]:
# Describe
company.describe()

            Salary
             count   mean        std    min    25%    50%    75%    max
Corporation
Apple          2.0  165.0  49.497475  130.0  147.5  165.0  182.5  200.0
Google         2.0  170.0  70.710678  120.0  145.0  170.0  195.0  220.0
Meta           2.0  170.0  28.284271  150.0  160.0  170.0  180.0  190.0